bouchons/test-performance-gatling/src/gatling/user-files/request-bodies/generalMessage.xml


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsdl="http://wsdl.siri.org.uk"
	xmlns:siri="http://www.siri.org.uk/siri">
	<soapenv:Header />
	<soapenv:Body>
		<wsdl:GetGeneralMessage>
			<ServiceRequestInfo>

				<siri:RequestTimestamp>${requestTimestamp}</siri:RequestTimestamp>

				<siri:RequestorRef>${requestorRefDiffuseur}</siri:RequestorRef>
				<!--Optional: -->
				<siri:MessageIdentifier>${messageIdentifier}</siri:MessageIdentifier>

			</ServiceRequestInfo>
			<Request version="2.0:FR-IDF-2.4-1-2.1">
				<siri:RequestTimestamp>${requestTimestamp}</siri:RequestTimestamp>
				<!--Optional: -->
				<siri:MessageIdentifier>${messageIdentifier}</siri:MessageIdentifier>
				<!--Zero or more repetitions: -->
				<siri:InfoChannelRef>${infoChannelRef}</siri:InfoChannelRef>
				<!--Optional: -->
				<siri:Language>${language}</siri:Language>
				<!--Optional: -->
				<siri:Extensions>
					<!--You may enter ANY elements at this point -->
					<IDFGeneralMessageRequestFilter>
						<StopPointRef>${monitoringRef}</StopPointRef>
					</IDFGeneralMessageRequestFilter>
				</siri:Extensions>
			</Request>
			<RequestExtension>
				<!--You may enter ANY elements at this point -->
			</RequestExtension>
		</wsdl:GetGeneralMessage>
	</soapenv:Body>
</soapenv:Envelope>